{"pages":[{"title":"Đôi nét về Tôi","text":"","link":"/about/index.html"}],"posts":[{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new \"My New Post\" More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2020/04/06/hello-world/"},{"title":"Github.io và Hexo cài đặt như thế nào ?","text":"Tại sao lại chọn Github.io và Hexo2 Lý do đơn giản để lựa chọn sử dụng Github.io và Hexo để tự tạo cho bản thân 1 Blog là “Miễn Phí” và “Đơn Giản” Mỗi năm chi phí để duy trì 1 Blog nhỏ với tên miền riêng và hosting cũng có thể tốn đến cả triệu đồng nhưng có khi lại mang lại những điều khó chịu như là chậm quá, lag ghê, tốn tiền mà sao chán vậy. Thế thì thôi lựa chọn 1 nền tảng miễn phí, không quá lằng nhằng nếu đã làm quen được 2 hoặc 3 hôm nói chung là không tốn tiền thì tội gì không thử. Có khó sử dụng không ?Có nhiều những nền tảng khác nhau cũng miễn phí nhưng tôi lại lựa chọn Github.io và Hexo vì đang lượn lờ thì thấy có 1 cái theme ưng ý. Vừa mới làm quen được 3 ngày kết luận với 1 người không biết gì như tôi là: Mới đầu thấy khó, tự mần mò 1 lúc thì cũng tàm tạm ở mức độ như: cài đặt hexo, cài theme, tạo bài viết, chỉnh sửa vài cái nhỏ nhỏ với hướng dẫn sử dụng cua theme, viết 1 bài nho nhỏ khai mạc, deploy lên được Github và quan trọng nhất là chạy được :). Nếu chăm chỉ tìm hiểu thêm chắc có thể làm vài việc khác, nhưng với 1 người không chuyên như tôi thế này là đủ. Cài đặt sử dụng thế nào ?Với người chả biết tí tẹo nào về code khi đọc các bài hướng dẫn trên mạng cảm nhận của tôi là “Bây giờ copy được mấy cái đoạn code cài đặt rồi đấy nhưng dán nó vào đâu -.- “,”Cài thế quái nào với cái hướng dẫn kiểu này đây T.T “ Nên tóm lược lại của 1 đứa không biết gì trở thành biết chút tí thì cần làm các bước sau: 1. Cài các thứ cần thiết:- [Node.js](https://nodejs.org/) - [Git](https://git-scm.com/)Nếu đã cài xong 2 phần mềm này hoặc đã có sẵn bước luôn đến phần tiếp theo 2. Cài đặt Hexo1npm install -g hexo-cli Có 3 cách để sử dụng cái đoạn code lằng nhằng này nhưng đơn giản nhất là dùng luôn Command Prompt copy code ở trên Paste vào ô lệnh như hình (Command Prompt là gì thì google cả đống)Enter và chờ các đoạn code chạy, nhớ là đừng tắt nhé sau khi chạy xong tiếp tục cài đặt các phần tiếp theo 3. Khởi tạo dự án Blog của riêng mìnhLệnh để cài tạo và cài đặt thư mục mà bạn đặt Blog của mình vào. hexo init blog có thể thay đổi từ blog thành bất cứ tên gì bạn thích nhưng chú ý là không có dấu nhé, ngắn dọn dễ nhớ là ưu tiên 1hexo init blog Đoạn code để tiến vào thư mục blog mà bạn đã tạo 1cd blog Đoạn code để cài đặt các thứ cần thiết cho blog của bạn có thẻ chạy được 1npm install Và đoạn code cuối cùng. Úm ba la mở ra 1 localhost bạn có thể truy cập với http://localhost:4000 nhìn nó sẽ như thế này nàyĐến phần màu mè nào Cài đặt và Sử dụng themeTìm Theme miễn phíBạn có thể tự viết cho bản thân 1 theme ưng ý nhưng với người chả biết gì như tôi tốt nhất là đi kiếm 1 theme mà những người khác đã tạo ra và sử dụng. Kiếm ở đâu ? ở đây chứ đâu https://hexo.io/themes/ với blog của mình tôi sử dụng theme Icarus. Cài Them thế nàoHướng dẫn cài đặt đơn giản nhất là vào theme của mình sử dụng và xem hướng dẫn mà tác giả đã đưa ra, với theme Icarus thì sử dụng dòng code sau dán vào màn hình Command Prompt mà bạn đang sử dụng từ đầu đến giờ. Chú ý là tắt cái localhost đi bằng phím ctrl+c rồi ấn phím y nhé, mục đích là tắt host đi nhưng vẫn tiếp tục làm việc tại thư mục blog mà bạn đã tạo ra 1git clone https://github.com/ppoffice/hexo-theme-icarus.git themes/icarus Chờ 1 lúc đến khi nào cài xong chỉnh sửa lại file _config.yml trong thư mục blog của bạn, chú ý nhé đây là file nằm ngay khi bạn mở thư mục blog ra và thấy, sâu trong các thư mục sẽ vẫn có thêm vài file _config.yml nhưng những file này tính sau nhé. Kích hoạt themeKhi file _config.yml tìm đến dòng theme sẽ thấy 1theme: landscape Bạn đổi thành 1theme: icarus Cơ bản khác nhau ở đoạn code cài theme còn cách kích hoạt theme thì cứ vào thư “themes” thấy thư mục nào có tên giống tên theme mình cài thì vào file _config.yml sửa lại.Thế là xong các bước cài đặt để có 1 blog trên localhost. Tạo 1 Github Pages (Tạo tên miền từ Github)Hoàn toàn đơn giản ở bước này đầu tiên bạn cần tạo 1 tài khoản tại GithubTạo 1 Repository với định dạng github-username.github.io vì dụ username của tôi là baprang thì Repository của tôi sẽ là baprang.github.io . Chú ý là nếu Repository đặt khác theo hướng dẫn thì sau khi Deploy blog của bạn nó sẽ không chạy và sẽ hiện lỗi 404 nhé.Hình của tôi báo là đã có rồi vì tôi đang dùng để chạy blog này đây chứ cú pháp là phải đúng y mới đc nhé. Deploy blog của bạn lên Github PagesĐây là bước cuối cùng của bạn để có thể truy cập blog của bạn trên internet. Sau khi đã tạo xong repo(Repository) và deploy xong địa chỉ truy cập của bạn sẽ là github-username.github.io Tại _config.yml trong folder blog bạn dùng để kích hoạt theme tìm đến đoạn deploy và chỉnh sửa như sau: 123deploy: type: git repo: https://github.com/github-username/github-username.github.io.git Cụ thể với mình sẽ là https://github.com/baprang/baprang.github.io.git Install package hexo-deployer-git1npm install hexo-deployer-git -save Deploy lên Github1hexo deploy Tận hưởngTruy cập vào địa chỉ của bạn github-username.github.io và blog hay web site của bạn sẽ ở ngay đâyĐẹp miên man theo theme mà bạn chọnBonusMỗi khi bạn có thay đổi gì đó với trang web của mình hãy sử dụng các đoạn code sau để có thể deploy1hexo generate 1hexo deploy Một blog hoặc website miễn phí chúc bạn thành công :)","link":"/2020/04/07/github-io-va-hexo-cai-dat-nhu-the-nao/"},{"title":"Lỗi plugins search trong theme Icarus và cách sửa lỗi","text":"Lỗi plugins là gì ?Lỗi ở đây đơn giản là khi nhấp vào cái kính lúp tìm kiếm thì không hiện ra gì, mọi thứ im re như là nút kính lúp không hề tồn tại Sửa lỗi này thế nàoVới lỗi này tôi đã thử hết tất cả các hướng dẫn từ chủ theme nhưng không hiệu quả, lên trang plugins của Hexo để tìm và cài đặt theo hướng dẫn nhưng cũng không ăn thua, sau 1 lúc lần mò thì thấy té ra đơn giản, sử dụng luôn plugins Insight Search có sẵn của theme Cầu hình pluginsBạn đơn giản chỉ cần thêm dòng cấu hình này vào file _config.yml của theme, còn nếu mở ra đã thấy sẵn rồi thì thôi bỏ qua đến phần tiếp theo 12search: type: insight Chỉnh sửa file bị saiSau khi bạn cài đặt và chạy thử theme nó sẽ sinh ra 1 cái file là js%5Cinsight.js chả hiểu sao lại có cái file tên kì quái thế này nhưng nó đang gặp 2 cái sai khi được sinh ra đó là sinh ra nhầm chỗ và được đặt nhầm tên.Để sửa sai: 1. Thay đổi tên. Bạn hay chỉnh tên file lại thành insight.js 2. Đưa file đến nơi đúng của nó đó là public\\js Hoàn tấtChỉ cần bạn chạy lại localhost và vào tìm kiếm thôi. Giao diện tìm kiếm thì có vẻ hơi thôi nhưng bù lại hiện tại thấy khá nhanh và tiện. Chúc các bạn thành công, nếu có lỗi ở các chức năng tìm khác thì đến bây giờ tôi chịu :)","link":"/2020/04/08/loi-plugin-search-trong-theme-icarus-va-cach-sua-loi/"},{"title":"Cài đặt file Apk, Apks và Game có OBB từ nguồn ngoài CHplay","text":"Những điều cần biếtTiềm hiểu 1 tẹo về các file APK, APKS và OBB. Các file này sử dụng để cài đặt các ứng dụng, trò chơi trên điện thoại hoặc các thiết bị sử dụng hệ điều hành Android. Và thường sử dụng khi cài đặt từ các nguồn không chính thống từ Play Store (CHplay). Tệp APKAPK là một tệp từ khi tôi sử dụng điện thoại Android đã có :D Nó được sự dụng để cài phần mềm đã được chữa lại như những game, ứng dụng tính phí.Trích lại 1 nguồn về file APK như sau: APK là viết tắt của cụm từ tiếng Anh “Android application package”. APK là một định dạng file nén. Nó tương tự như ZIP, dựa trên định dạng JAR, và sử dụng phần mở rộng là .apk.*Đơn giản như trên PC thì có file *.exe tải về mở ra cài đặt là có game chơi, phần mềm để dùng chứ không phải là copy cái icon hay shortcut rồi về mở ra để nghiên cứu nhé. Tệp APKSAPKS thì cũng là 1 file dùng để cài đặt như APK, như tôi hiểu thì công dụng của nó giống như file APK. Tuy nhiên lằng nhằng hơn 1 điểm là không cài đặt như APK chỉ cần ấn vào là cài. File APKS khi cài lại cần 1 phần mềm nữa, tôi hiện đang dùng SAI (Split APKs Installer) :D Còn cụ thể APKS là gì tôi trích lược 1 đoạn như sau: APKs là một định dạng mới được sử dụng gần đây. Với sự xuất hiện của Android App Bundle, việc phát hành và tối ưu hóa các ứng dụng trên Play Store trở nên dễ dàng hơn rất nhiều đối với các nhà phát triển. Tuy nhiên, nó khiến người dùng không thể xuất và chia sẻ các tệp APK như bình thường nữa. Thay vào đó, bạn cần sử dụng tới APKs. Về bản chất, một tệp APKs là tập hợp của nhiều file APK khác nhau. Ví dụ, nếu bạn muốn cài đặt ứng dụng Swiftkey bản Mod, tệp tin bạn tải về sẽ gồm 4 file APK nhỏ và cho dù bạn cài đặt tệp APK nào thì cũng nhận được một thông báo lỗi. Tệp OBBOBB là phần dữ liệu bổ sung của trò chơi hoặc ứng dụng, nó chứa các bộ sưu tập các tập tin khác nhau như: âm thanh, đồ họa, kịch bản … Một số game bắt buộc có OBB để hoạt động, một số thì không. Thông thường, các tệp OBB có kích thước lớn và cần một công cụ phù hợp để giải nén. Nếu bạn thường xuyên tải và cài đặt các trò chơi có dung lượng cao, bạn sẽ gặp OBB file thường xuyên. Thường là các file game hoặc phầm mềm đã được thuốc. Cách sử dụng OBB file thì rất đơn giản. Bạn không cần cài đặt nó như tệp APK hay APKs, chỉ cần di chuyển nó tới đúng thư mục yêu cầu để đảm bảo trò chơi có thể hoạt động ổn định. Hương dẫn cài đặt file APK, APKS và OBBCài File APKĐơn giản nhất trong tất cả, chỉ cần tải file về và ấn cài đặt. Với các file cài đặt không từ nguồn của CHPlay, khi nhấp vào cài đặt sẽ cần xác nhận Nguồn không xác định Hoặc bật trong Cài đặt =&gt; Bảo Mật =&gt; Nguồn không xác địnhVới các phiên bản Android mới sẽ cung cấp quyền cho các ứng dụng lẻ, ví dụ như bạn tải ứng dụng về từ Chrome thì khi hoàn tất tải về và nhấp cài đặt hệ thống sẽ hỏi cấp quyền cài đặt ứng dụng từ nguồn là Chrome. Cài File APKSSau khi cài đặt ứng dụng SAI (Split APKs Installer) Mở ứng dụng SAI Ấn vào mục Install APKs Chọn thư mục có file APKs cần cài đặt Chọn ứng dụng cần cài đặt =&gt; Ấn vào select =&gt; Ứng dụng sẽ bắt đầu mở file, các bạn cần chờ 1 chút sau đó bảng cài đặt tương tự cài đặt file APK sẽ hiện lên và bắt đầu cài đặt tương tự file APK Cài File OBBThường các file OBB là 1 thư mục dữ liệu và được nén lại dưới định dạng .zip hoặc .rar.Vì vậy bạn cần giải nén file này ra bạn nhận được một thư mục thường có tên dạng com.developer-name.androidpackage.Tiếp theo, di chuyển nó tới đường dẫn đích SDCard: Android/OBB Sau khi đã hoàn tất thì mở ứng dụng hoặc trò chơi lên và thưởng thức thôi.","link":"/2020/04/12/cai-dat-file-apk-apks-va-game-co-obb-tu-nguon-ngoai-chplay/"}],"tags":[{"name":"Github.io","slug":"Github-io","link":"/tags/Github-io/"},{"name":"Hexo","slug":"Hexo","link":"/tags/Hexo/"},{"name":"Plugins","slug":"Plugins","link":"/tags/Plugins/"},{"name":"Hướng dẫn","slug":"Huong-dan","link":"/tags/Huong-dan/"}],"categories":[{"name":"Tự xây Blog","slug":"Tu-xay-Blog","link":"/categories/Tu-xay-Blog/"},{"name":"Github.io","slug":"Tu-xay-Blog/Github-io","link":"/categories/Tu-xay-Blog/Github-io/"},{"name":"Hexo","slug":"Tu-xay-Blog/Hexo","link":"/categories/Tu-xay-Blog/Hexo/"},{"name":"Phone","slug":"Phone","link":"/categories/Phone/"},{"name":"Androi","slug":"Phone/Androi","link":"/categories/Phone/Androi/"}]}